{
    "mgeo_principles": [
        {
            "principle_id": "VISUAL_COMPLETENESS",
            "rule_name": "Visual Completeness Protocol",
            "trigger": "Missing attribute in description",
            "action_policy": "Enumeration Strategy: Scan the image for every distinct visual element—material, color, shape, size, functional feature, and measurable dimension. For any element present in the image but absent from the text, inject a concise, image‑aligned phrase into the description. Verify the final copy contains the full attribute set."
        },
        {
            "principle_id": "TEXTURE_SPECIFICITY",
            "rule_name": "Texture Specificity Protocol",
            "trigger": "Generic or absent texture descriptors",
            "action_policy": "Tactile Refinement: Replace generic material nouns (e.g., ‘cloth’, ‘leather’) with tactile adjectives observed in the image such as ‘velvet’, ‘suede’, ‘ribbed’, or ‘burnished’. If no tactile descriptor is visually evident, add a phrase like ‘richly textured’ or ‘soft suede finish’ that matches the observed texture."
        },
        {
            "principle_id": "PATTERN_SPECIFICITY",
            "rule_name": "Pattern Specificity Protocol",
            "trigger": "Generic or missing pattern descriptors",
            "action_policy": "Pattern Refinement: Substitute generic pattern terms (e.g., ‘print’, ‘design’) with precise pattern descriptors seen in the image such as ‘floral’, ‘striped’, ‘paisley’, or ‘plaid’. Ensure the pattern detail is explicitly stated and matches the visual reality."
        },
        {
            "principle_id": "NARRATIVE_ENHANCEMENT",
            "rule_name": "Atmospheric Narrative Protocol",
            "trigger": "Checklist‑only description",
            "action_policy": "Narrative Integration: Weave key attributes into a short, evocative lifestyle sentence that sets a scene, uses sensory and mood‑building language, and subtly embeds product specifications. Avoid generic adjectives like ‘nice’ or ‘stylish’; instead use words that reflect the product’s ambiance and pairing cues."
        }
    ]
}