{
    "mgeo_principles": [
        {
            "strategy_name": "Comprehensive Visual Attribute Specification",
            "gap_type": "COMPLETENESS",
            "observation_summary": "Product copy frequently omits crucial visual details (material, color, pattern, shape, style), resulting in vague descriptions that diverge from the image and fail to match user intent.",
            "action_policy": "When generating or refining product copy, the Optimizer Agent must explicitly list every salient visual attribute—material, color, pattern, shape, and style—so that the description fully mirrors the image and aligns with user intent, thereby enhancing search relevance.",
            "support_count": 9,
            "cluster_id": 0
        },
        {
            "strategy_name": "Visual Completeness & Specificity Strategy",
            "gap_type": "SPECIFICITY",
            "observation_summary": "Product descriptions frequently omit or generalize key visual attributes, failing to fully represent the items shown in images.",
            "action_policy": "The Optimizer Agent must explicitly enumerate every observable visual attribute—material, color, texture, design details, style cues, closure type, sole construction, and any other visible feature—using precise, accurate language that mirrors the product image. If an attribute is not visible, it should be omitted. The agent should cross‑check the description against the image to ensure full coverage and consistency.",
            "support_count": 33,
            "cluster_id": 1
        },
        {
            "strategy_name": "Explicit Visual Attribute Specificity Principle",
            "gap_type": "SPECIFICITY",
            "observation_summary": "Descriptions frequently omit critical visual details—material, color, shape, texture—leading to lower relevance and ranking.",
            "action_policy": "Ensure every item in a description explicitly names its material, color, shape, and texture to fully capture the image’s visual attributes.",
            "support_count": 6,
            "cluster_id": 2
        },
        {
            "strategy_name": "Visual Attribute Precision",
            "gap_type": "SPECIFICITY",
            "observation_summary": "Descriptions frequently omit or generalize critical visual details (material, shape, dimensions, closure), creating a mismatch between text, image, and query, which lowers relevance and ranking.",
            "action_policy": "The Optimizer Agent must fully enumerate every visual attribute depicted in the image—material, shape, measurements, closure type, and any other observable feature—while excluding extraneous non-visual details. Ensure the description semantically aligns with the query and the visual content for maximum relevance.",
            "support_count": 10,
            "cluster_id": 3
        },
        {
            "strategy_name": "Complete Visual Feature Detailing",
            "gap_type": "COMPLETENESS",
            "observation_summary": "Optimizers frequently omit or under‑describe critical visual attributes—such as material, closure type, toe shape, heel type, and other distinctive details—leading to incomplete or misleading outputs that reduce search relevance and user trust.",
            "action_policy": "When describing an image, explicitly list all major visual attributes (material, closure, toe shape, heel type, etc.) and any unique or distinguishing details. If an attribute is not visually evident, state that it is not observable. This comprehensive approach ensures completeness and maximizes relevance for downstream search queries.",
            "support_count": 5,
            "cluster_id": 4
        },
        {
            "strategy_name": "Complete & Specific Visual Description Alignment",
            "gap_type": "SPECIFICITY",
            "observation_summary": "Copy frequently omits or generalizes key visual attributes (material, texture, shape, color, style), leading to mismatches between the product image and its textual representation and lowering relevance.",
            "action_policy": "The Optimizer must explicitly list every observable attribute in the image using precise, concrete language, avoiding generic placeholders, omissions, or vague terms. Each product description should enumerate material, texture, shape, color, and style details so that the copy fully matches the shopper’s visual intent and improves relevance and ranking.",
            "support_count": 24,
            "cluster_id": 5
        },
        {
            "strategy_name": "Visual Attribute Precision",
            "gap_type": "SPECIFICITY",
            "observation_summary": "Generic or mismatched descriptors in product listings create a relevance gap between image and text, lowering search ranking.",
            "action_policy": "Always align every observable attribute in the product image (material, style, texture, finish, etc.) with precise, accurate descriptors in the listing. Avoid generic or ambiguous terms, and validate each descriptor against the image to ensure direct correspondence.",
            "support_count": 7,
            "cluster_id": 6
        },
        {
            "strategy_name": "Visual Specificity & Stylistic Alignment Principle",
            "gap_type": "SPECIFICITY",
            "observation_summary": "Copy often omits concrete visual details—exact colors, patterns, and aesthetic style—leading to misalignment with search intent and reduced ranking potential.",
            "action_policy": "Ensure every description explicitly names the precise colors, patterns, and aesthetic style reflected in the product image, using vivid, evocative language that mirrors the visual mood and atmosphere of the product.",
            "support_count": 6,
            "cluster_id": 7
        },
        {
            "strategy_name": "Visual Attribute & Atmosphere Alignment",
            "gap_type": "COMPLETENESS",
            "observation_summary": "Descriptions frequently omit or misstate key visual attributes—color, pattern, texture, material, size—and fail to match the style or mood implied by the user’s intent or the product image.",
            "action_policy": "For every product, verify that the description enumerates all visible attributes in detail and that the tone, adjectives, and overall mood align with the user’s desired atmosphere. If any attribute is missing or mismatched, enrich the text to close the gap before publishing.",
            "support_count": 6,
            "cluster_id": 8
        },
        {
            "strategy_name": "Visual Attribute Precision",
            "gap_type": "SPECIFICITY",
            "observation_summary": "Copy often omits explicit descriptions of visible colors, patterns, and textures present in product images, resulting in vague listings that fail to match user search intent and create uncertainty.",
            "action_policy": "Always identify and name every visible color, pattern, and texture in the product image before drafting copy. Include these specifics in the headline, bullet points, and product description to ensure the text accurately reflects the visual content and satisfies the shopper’s search intent.",
            "support_count": 13,
            "cluster_id": 9
        },
        {
            "strategy_name": "Exact Visual Attribute Alignment",
            "gap_type": "SPECIFICITY",
            "observation_summary": "Product descriptions consistently miss the precise visual details—color, pattern, texture, material, dimensions, and mood—shown in the image, weakening relevance signals and lowering search rankings.",
            "action_policy": "For every listing, extract and incorporate the exact visual attributes from the product image (e.g., hex color codes, pattern type, texture style, material composition, measured dimensions, and the intended mood or atmosphere). Ensure the description reflects these details verbatim, achieving 100% alignment with the photographed item.",
            "support_count": 19,
            "cluster_id": 10
        },
        {
            "strategy_name": "Visual Detail Precision",
            "gap_type": "SPECIFICITY",
            "observation_summary": "Descriptions frequently omit or generalize concrete visual elements—counts, arrangements, materials, and colors—leading to incomplete or inaccurate mirrors of the image.",
            "action_policy": "When generating a visual description, the Optimizer Agent must list every visible element with explicit detail: count, spatial arrangement, material composition, and precise color. No generic terms (e.g., \"objects\", \"things\") are allowed; each item must be uniquely identified and described so that the text fully and accurately reproduces the image.",
            "support_count": 18,
            "cluster_id": 11
        },
        {
            "strategy_name": "Exact Visual Match Principle",
            "gap_type": "SPECIFICITY",
            "observation_summary": "Copy frequently fails to list all key visual elements—materials, finishes, textures, and structural details—leading to mismatches between the text and the image.",
            "action_policy": "Always identify and explicitly describe every prominent visual feature present in the image, including materials, finishes, textures, and structural elements, to ensure the copy perfectly mirrors the product’s appearance.",
            "support_count": 6,
            "cluster_id": 12
        },
        {
            "strategy_name": "Comprehensive Visual Detail Description",
            "gap_type": "COMPLETENESS",
            "observation_summary": "Product descriptions often omit or understate key visual attributes—such as material, color, texture, structural elements, and stylistic cues—resulting in vague or incomplete narratives that reduce search relevance.",
            "action_policy": "When generating a description for any product image, explicitly list every visible attribute: material type, exact colors, texture details, shape and structural features, and any stylistic or design cues. Use precise, specific language and avoid generic terms, ensuring the text fully aligns with the visual content to maximize search accuracy.",
            "support_count": 7,
            "cluster_id": 13
        },
        {
            "strategy_name": "Full Visual Fidelity Principle",
            "gap_type": "COMPLETENESS",
            "observation_summary": "Product descriptions frequently omit key visual attributes (color, material, shape, style, functional details), leading to mismatch with images and reduced search relevance.",
            "action_policy": "When generating or optimizing product descriptions, explicitly enumerate every major visual attribute—color, material, shape, style, and functional details—so that the text fully reflects the image’s appearance and maximizes search relevance.",
            "support_count": 8,
            "cluster_id": 14
        },
        {
            "strategy_name": "Visual Attribute Completeness & Specificity Optimization",
            "gap_type": "COMPLETENESS",
            "observation_summary": "Descriptions frequently omit or generalize key visual features (materials, colors, shapes, components, dimensions), leading to mismatches between the text, the image, and the user’s intent.",
            "action_policy": "The Optimizer Agent must first parse the image to identify every prominent visual attribute—materials, colors, shapes, components, and dimensions. It should then embed each attribute explicitly and precisely in the product description, ensuring that every identified feature is mentioned and accurately reflects what the user sees.",
            "support_count": 5,
            "cluster_id": 15
        },
        {
            "strategy_name": "Explicit Visual Detail Alignment",
            "gap_type": "SPECIFICITY",
            "observation_summary": "Descriptions often omit visible components, materials, finishes, or functional features, resulting in incomplete and inaccurate representations of the image.",
            "action_policy": "For every image, enumerate all visible elements, specify each element's material and finish, and note any functional attributes exactly as depicted. Ensure the text fully mirrors the visual reality in detail.",
            "support_count": 14,
            "cluster_id": 16
        },
        {
            "strategy_name": "Complete Visual-Textual Alignment",
            "gap_type": "COMPLETENESS",
            "observation_summary": "Descriptions frequently omit or generalize visible components, materials, and functional features, resulting in mismatches between the text and the image.",
            "action_policy": "When crafting product descriptions, first review the image to catalog every visible component, material, and functional attribute. Use precise, image‑matching terminology to list each item explicitly, and avoid generic placeholders or unrelated elements.",
            "support_count": 6,
            "cluster_id": 17
        },
        {
            "strategy_name": "Explicit Visual Attribute Inclusion",
            "gap_type": "COMPLETENESS",
            "observation_summary": "Descriptions frequently miss or gloss over key visual details—such as shape, dimensions, material, color, and visible hardware—leading to incomplete matches and lower search rankings.",
            "action_policy": "Always list every key visual attribute observed in the image—shape, dimensions, material, color, and any visible hardware—so the description fully reflects the visual content.",
            "support_count": 3,
            "cluster_id": 18
        },
        {
            "strategy_name": "Visual Completeness & Specificity",
            "gap_type": "SPECIFICITY",
            "observation_summary": "Descriptions frequently miss precise visual details—material, finish, shape, and exact dimensions—leading to generic or unrelated specifications.",
            "action_policy": "Require each product description to explicitly list every visual attribute shown in the image (material, finish, shape, dimensions) and exclude any generic or unrelated information.",
            "support_count": 12,
            "cluster_id": 19
        },
        {
            "strategy_name": "Texture Detail Amplification",
            "gap_type": "SPECIFICITY",
            "observation_summary": "Use of generic texture terms (e.g., ‘soft’, ‘smooth’) fails to evoke vivid, memorable imagery; concrete descriptors (e.g., ‘hand‑stitched lattice’, ‘woven jacquard’) are essential.",
            "action_policy": "Always describe visual textures with explicit, concrete language that conveys pattern, stitching, weave, or other tactile cues, and avoid vague adjectives.",
            "support_count": 1,
            "cluster_id": 20
        },
        {
            "strategy_name": "Intent‑Aligned Performance Language",
            "gap_type": "ATMOSPHERE",
            "observation_summary": "Content frequently uses generic or unrelated descriptors, creating a mismatch between the page’s atmosphere and the user’s search intent, which dilutes relevance and clarity.",
            "action_policy": "When optimizing text, first extract the core intent keywords from the query. Replace vague or generic terms with explicit, performance‑centric descriptors that directly match that intent (e.g., ‘running & walking shoe’, ‘breathable mesh upper’, ‘lightweight’). Ensure the opening sentences immediately signal these attributes so the content’s atmosphere aligns perfectly with the user’s search purpose.",
            "support_count": 2,
            "cluster_id": 21
        }
    ]
}