{
    "mgeo_principles": [
        {
            "strategy_name": "Precision Visual Attribute Description",
            "gap_type": "SPECIFICITY",
            "observation_summary": "Search ranking drops when product text omits or generalizes visible attributes (color, material, pattern, construction).",
            "action_policy": "For every perceptible attribute in the image—color, material, pattern, construction, etc.—include a detailed, specific description in the product text so the text fully mirrors the visual information.",
            "support_count": 13,
            "cluster_id": 0
        },
        {
            "strategy_name": "Complete Visual Feature Description",
            "gap_type": "COMPLETENESS",
            "observation_summary": "Descriptions often omit or under‑describe key visual elements such as patterns, colors, textures, materials, and shapes, resulting in incomplete matches to the user’s search intent.",
            "action_policy": "The Optimizer Agent must explicitly and comprehensively list every prominent visual element—patterns, colors, textures, materials, and shapes—present in the image, ensuring the description fully captures what the user is looking for.",
            "support_count": 7,
            "cluster_id": 1
        },
        {
            "strategy_name": "Visual Attribute Completeness",
            "gap_type": "COMPLETENESS",
            "observation_summary": "Product descriptions frequently omit key visual details, leading to a mismatch between what buyers see and what search engines index.",
            "action_policy": "The Optimizer Agent must ensure that every product description explicitly lists all salient visual attributes—including color, pattern, texture, and style features—so the text fully aligns with buyer expectations and search engine requirements.",
            "support_count": 10,
            "cluster_id": 2
        },
        {
            "strategy_name": "Feature‑Centric Visual Alignment",
            "gap_type": "COMPLETENESS",
            "observation_summary": "Product descriptions frequently omit or misstate observable attributes (color, material, shape, closure, etc.), creating a visual‑text mismatch.",
            "action_policy": "Explicitly list every observable feature of the product in the text—using accurate, specific visual terms—and exclude any unrelated or incorrect details. The description should mirror the image exactly to close the visual‑textual gap.",
            "support_count": 51,
            "cluster_id": 3
        },
        {
            "strategy_name": "Attribute-Driven Visibility Precision",
            "gap_type": "SPECIFICITY",
            "observation_summary": "Product descriptions frequently omit or under‑describe key visible structural features (toe shape, heel type/height, style, etc.), causing search engines to misinterpret or overlook the product’s visual content.",
            "action_policy": "For every product, enumerate and describe every visible attribute in explicit, unambiguous terms—covering toe shape, heel type and height, style, color, material, and any distinctive design elements—so that the text fully reflects the product’s visual appearance and aligns with user queries.",
            "support_count": 9,
            "cluster_id": 4
        },
        {
            "strategy_name": "Descriptive Completeness Principle",
            "gap_type": "COMPLETENESS",
            "observation_summary": "Copy frequently omits key visual attributes—color, material, shape, closure, and distinctive design details—leading to incomplete representation of the image and missed search relevance.",
            "action_policy": "The Optimizer Agent must always enumerate every observable visual feature of a product in its copy, using evocative, scene‑building language that mirrors the product’s appearance to ensure full visual alignment with the image.",
            "support_count": 17,
            "cluster_id": 5
        },
        {
            "strategy_name": "Visual Alignment & Detail Precision",
            "gap_type": "SPECIFICITY",
            "observation_summary": "Descriptions that omit exact pattern shapes, colors, textures, or fail to mirror the image’s attributes suffer from low relevance, harming search ranking.",
            "action_policy": "Ensure every product description explicitly names all visible pattern shapes, exact color palettes, texture cues, and overall mood to match the product image.",
            "support_count": 22,
            "cluster_id": 6
        },
        {
            "strategy_name": "Visual Completeness & Specificity Principle",
            "gap_type": "SPECIFICITY",
            "observation_summary": "Product copy frequently fails to name all visible visual attributes—pattern, color palette, texture, pile height, material, and mood—resulting in an incomplete, vague depiction that diminishes relevance and ranking.",
            "action_policy": "When optimizing product descriptions, explicitly list every salient visual detail present in the image: exact colors, pattern type, texture description, pile height, material composition, and the overall atmosphere or mood. This ensures a complete, vivid, and accurate portrayal that aligns tightly with the visual content.",
            "support_count": 25,
            "cluster_id": 7
        },
        {
            "strategy_name": "Complete Visual Attribute Inclusion",
            "gap_type": "COMPLETENESS",
            "observation_summary": "Listings often omit critical visual descriptors—color, material, shape, size, or style—leading to mismatches in search relevance and ranking.",
            "action_policy": "When drafting titles and descriptions, explicitly enumerate every key visual attribute (color, material, shape, size, style) so the product can be accurately matched and ranked.",
            "support_count": 9,
            "cluster_id": 8
        },
        {
            "strategy_name": "Visual Detail Precision",
            "gap_type": "SPECIFICITY",
            "observation_summary": "Output often omits critical visual details (color, material, shape, number of components) or uses generic descriptors that do not reflect the user’s style intent, leading to ambiguous or incomplete imagery.",
            "action_policy": "For every visual description, explicitly list all key elements—color, material, shape, quantity of components—directly tying each detail to the user’s specified style or intent, and refrain from using generic or unrelated wording.",
            "support_count": 7,
            "cluster_id": 9
        },
        {
            "strategy_name": "Exact Visual Attribute Detailing",
            "gap_type": "SPECIFICITY",
            "observation_summary": "Generated content often omits precise material, color, shape, and finish details, leading to incomplete or inaccurate representations of the image.",
            "action_policy": "Ensure every visible visual element is described using precise, material‑specific terms, covering color, shape, finish, quantity, and style so that the text fully matches the image.",
            "support_count": 18,
            "cluster_id": 10
        },
        {
            "strategy_name": "Complete Visual Feature Fidelity",
            "gap_type": "COMPLETENESS",
            "observation_summary": "Product copy often omits or under‑describes key visual elements (color, material, shape, dimensions, unique details), resulting in a mismatch between the textual description and the image and leaving user search intent partially unmet.",
            "action_policy": "Before finalizing any product copy, explicitly list every critical visual attribute—color, material, shape, dimensions, and any distinguishing details—using precise, descriptive language. Verify that each element is present and accurately reflected in the image, ensuring the text fully matches the visual content and satisfies user search intent.",
            "support_count": 9,
            "cluster_id": 11
        },
        {
            "strategy_name": "Visual Attribute Detailing",
            "gap_type": "COMPLETENESS",
            "observation_summary": "Product descriptions frequently omitted key visual details—color, finish, shape, dimensions, and hardware—resulting in incomplete, ambiguous representations that do not fully reflect the image.",
            "action_policy": "For every product description, explicitly list all visible visual attributes (color, finish, shape, dimensions, hardware) so the text mirrors the image and satisfies the user’s visual intent.",
            "support_count": 12,
            "cluster_id": 12
        },
        {
            "strategy_name": "Visual Concordance Principle",
            "gap_type": "COMPLETENESS",
            "observation_summary": "Descriptions that omit or add non‑visual details dilute relevance, causing lower search rankings.",
            "action_policy": "When drafting product descriptions, enumerate every attribute visible in the image—finish, dimensions, hardware, color, markings, and any other discernible cues—and exclude any unrelated or irrelevant information. Ensure the text mirrors the visual content exactly.",
            "support_count": 11,
            "cluster_id": 13
        },
        {
            "strategy_name": "Visual Attribute Precision",
            "gap_type": "SPECIFICITY",
            "observation_summary": "Descriptions frequently miss explicit, measurable visual details—such as dimensions, materials, finishes, and key components—leading to a mismatch between textual content and the image and causing ranking failures.",
            "action_policy": "When generating a description, explicitly enumerate all visible visual attributes: state exact dimensions, specify materials and finishes, and list each key component. Use measurable, concrete terms so the text aligns perfectly with the image.",
            "support_count": 11,
            "cluster_id": 14
        },
        {
            "strategy_name": "Specific Visual Detail Alignment",
            "gap_type": "SPECIFICITY",
            "observation_summary": "Descriptions frequently use generic or purely technical language that does not explicitly reference the material, finish, color, texture, and structural details visible in the image, causing misalignment with user expectations.",
            "action_policy": "The Optimizer Agent must explicitly name all visual attributes (material, finish, color, texture, structural details) that match the user’s query and the referenced image; avoid generic descriptors or purely technical terms that do not convey these visual specifics.",
            "support_count": 11,
            "cluster_id": 15
        },
        {
            "strategy_name": "Feature-Focused Visual Description",
            "gap_type": "COMPLETENESS",
            "observation_summary": "Descriptions often omitted or glossed over key visual details, leading to incomplete and vague depictions of the product.",
            "action_policy": "Always explicitly list every major visual attribute—color, material, texture, shape, closure, and decorative details—using precise, observable terminology that mirrors the user’s view.",
            "support_count": 14,
            "cluster_id": 16
        },
        {
            "strategy_name": "Explicit Visual Texture Detailing",
            "gap_type": "SPECIFICITY",
            "observation_summary": "Descriptions frequently omit or overgeneralize product textures and materials, leading to a mismatch between the visual input and the written content.",
            "action_policy": "When generating or optimizing text, the Agent must identify concrete texture, material, and structural cues from the image or prompt (e.g., Flyknit, round toe, layered texture) and incorporate them verbatim, avoiding generic terms like \"fabric\" or \"surface\". The description should mirror the visual details and explicitly satisfy the user’s intent.",
            "support_count": 8,
            "cluster_id": 17
        },
        {
            "strategy_name": "Visual Detail Transparency",
            "gap_type": "COMPLETENESS",
            "observation_summary": "Product copy frequently omits or glosses over key visible attributes—such as materials, shapes, colors, textures, and design nuances—resulting in incomplete visual translation and diminished relevance to user intent.",
            "action_policy": "When generating or optimizing product copy, the Agent must explicitly enumerate every salient visible attribute: material composition, shape characteristics, color palette, texture details, and distinctive design elements. Use a clear, structured list or concise descriptive sentences that collectively capture the full visual reality, ensuring that no major attribute is omitted or generalized.",
            "support_count": 9,
            "cluster_id": 18
        },
        {
            "strategy_name": "Visual Detail Specificity",
            "gap_type": "SPECIFICITY",
            "observation_summary": "Text often omits explicit references to tufting, fabric texture, silhouette, and atmospheric mood, reducing the shopper’s visual experience.",
            "action_policy": "Ensure every product description explicitly details tufting style, fabric texture, silhouette shape, and atmospheric mood so the text fully mirrors the shopper’s visual perception.",
            "support_count": 6,
            "cluster_id": 19
        },
        {
            "strategy_name": "Visual Detail Alignment",
            "gap_type": "SPECIFICITY",
            "observation_summary": "Product copy frequently omits or generalizes visible textures, materials, and finishes, resulting in vague descriptions that miss key visual cues and SEO opportunities.",
            "action_policy": "For every product image, explicitly list all visible textures, materials, and finishes in the description. Use concrete, descriptive terms (e.g., \"hand‑woven linen weave\", \"patinaed brass finish\") and avoid generic adjectives. Structure the description with bullet points or short clauses so that each visual element is individually referenced, ensuring completeness of detail and maximizing relevance for both shoppers and search engines.",
            "support_count": 16,
            "cluster_id": 20
        },
        {
            "strategy_name": "Visual Attribute Completeness",
            "gap_type": "COMPLETENESS",
            "observation_summary": "Product descriptions frequently omit or insufficiently detail the key visual attributes present in the product image, causing misalignment and reduced search relevance.",
            "action_policy": "The Optimizer Agent must audit each product image and guarantee that every salient visual attribute—shape, color, texture, material, construction, and style—is explicitly captured in the product description.",
            "support_count": 20,
            "cluster_id": 21
        },
        {
            "strategy_name": "Complete Visual Attribute Coverage",
            "gap_type": "COMPLETENESS",
            "observation_summary": "Product listings omit key visual details (shape, pattern, color palette, texture, accents), hindering accurate image-to-search matching.",
            "action_policy": "Ensure every product description explicitly lists all visual attributes—shape, pattern, color palette, texture, and accent details—so search engines can fully align image intent with textual content.",
            "support_count": 5,
            "cluster_id": 22
        },
        {
            "strategy_name": "Visual Completeness & Atmosphere Principle",
            "gap_type": "COMPLETENESS",
            "observation_summary": "Product copy omits explicit, detailed visual attributes—color, pattern, texture, finish, and mood—leading to a mismatch between the description and the image.",
            "action_policy": "Require the Optimizer Agent to explicitly enumerate all salient visual features (pattern, color palette, texture, finish, style cues) and to contextualize them with a vivid, mood‑setting atmospheric description, ensuring the copy fully matches the image.",
            "support_count": 21,
            "cluster_id": 23
        },
        {
            "strategy_name": "Precision Visual Alignment Principle",
            "gap_type": "COMPLETENESS",
            "observation_summary": "Descriptions frequently omit or misstate key visual attributes—such as color, texture, pattern, material, shape, and orientation—resulting in a mismatch between text and image.",
            "action_policy": "Always provide a full, precise visual description: explicitly name every visible color, texture, pattern, material, dimension, shape, and orientation. Avoid generic or contradictory language, ensuring the copy fully matches the image.",
            "support_count": 22,
            "cluster_id": 24
        },
        {
            "strategy_name": "Mood-First Descriptive Optimization",
            "gap_type": "ATMOSPHERE",
            "observation_summary": "Generated descriptions overemphasize technical specifications at the expense of evocative, mood‑creating language, resulting in flat and less engaging visual narratives.",
            "action_policy": "When generating textual content, prioritize sensory, atmospheric detail that conveys color, texture, and vibe. Begin with mood-oriented adjectives, use vivid verbs, and weave environmental context to create a rich, immersive visual experience. Minimize pure technical listings unless explicitly required.",
            "support_count": 6,
            "cluster_id": 25
        },
        {
            "strategy_name": "Visual Detail Alignment",
            "gap_type": "SPECIFICITY",
            "observation_summary": "Text frequently omits precise visual descriptors such as color, pattern, texture, shape, or finish, causing a mismatch with the image and not meeting user search intent.",
            "action_policy": "Ensure every product description lists all relevant visual attributes—color, pattern, texture, shape, finish—using accurate, specific terminology, and cross‑check these details against the product image to guarantee full alignment.",
            "support_count": 8,
            "cluster_id": 26
        },
        {
            "strategy_name": "Explicit Visual Attribute Enumeration",
            "gap_type": "COMPLETENESS",
            "observation_summary": "Descriptions frequently omit or misrepresent key visual details—color, pattern, texture, shape, and finish—causing a mismatch with the product image and reducing relevance and ranking.",
            "action_policy": "For every product description, the Optimizer Agent must explicitly list all visual attributes: color, pattern, texture, shape, and finish. Each attribute should accurately reflect what is shown in the image, ensuring the text fully matches the visual content.",
            "support_count": 9,
            "cluster_id": 27
        },
        {
            "strategy_name": "Visual Completeness Optimization",
            "gap_type": "COMPLETENESS",
            "observation_summary": "Descriptions frequently omit essential visual details such as color, shape, material, finish, and distinctive pattern, leading to vague or misleading product representations.",
            "action_policy": "Ensure every visual description includes all primary attributes—color, shape, material, finish, and distinctive pattern—in vivid, specific terms, and exclude extraneous details about unrelated objects.",
            "support_count": 11,
            "cluster_id": 28
        },
        {
            "strategy_name": "Precision Visual Detail Policy",
            "gap_type": "COMPLETENESS",
            "observation_summary": "Descriptions often omit key visual attributes (color, material, finish, shape, unique features) or use vague terminology, resulting in inaccurate or incomplete product portrayals.",
            "action_policy": "When generating or optimizing a product description, first catalog every observable attribute in the image—color, material, finish, shape, and any distinctive features. Use precise, specific terminology for each attribute, avoid generic terms, and verify that no element is omitted. Cross‑check the final description against the image to ensure full and accurate representation.",
            "support_count": 8,
            "cluster_id": 29
        },
        {
            "strategy_name": "Visual Completeness Alignment Principle",
            "gap_type": "COMPLETENESS",
            "observation_summary": "Product descriptions that leave out or inaccurately portray key visual attributes (shape, color, material, distinctive design elements) break the alignment between the image and text, mislead users, and trigger search‑engine penalties.",
            "action_policy": "For every image, the description must fully enumerate all prominent visual features—strap style, buckle design, heel shape, platform height, color palette, material composition, and any unique decorative details—using precise, style‑oriented terminology that reflects the image. Avoid generic functional specs or omissions; ensure the language evokes the product’s look and feel while maintaining factual accuracy.",
            "support_count": 23,
            "cluster_id": 30
        },
        {
            "strategy_name": "Visual Feature Fidelity",
            "gap_type": "SPECIFICITY",
            "observation_summary": "Descriptions often omit or generalize key visual attributes—materials, textures, shapes, and functional elements—leading to vague or inaccurate representations of the product.",
            "action_policy": "Generate a complete, product‑specific enumeration of all visual features present in the image. Use precise terminology for materials, textures, shapes, and functional elements, and avoid generic placeholders or invented details that diverge from the visual content.",
            "support_count": 12,
            "cluster_id": 31
        }
    ]
}