{
    "mgeo_principles": [
        {
            "strategy_name": "Full Visual Attribute Alignment",
            "gap_type": "COMPLETENESS",
            "observation_summary": "Product descriptions frequently omit or generalize key visual attributes from images—colors, patterns, materials, silhouettes, and decorative details—leading to mismatched search intent, low relevance, and poor ranking.",
            "action_policy": "For every product image, the Optimizer Agent must generate a description that enumerates all prominent visual attributes (color, pattern, material, silhouette, style, contrast, decorative features) using precise, texture‑rich, query‑aligned terminology. Avoid generic placeholders; ensure the description fully mirrors the visual reality to improve intent alignment and ranking.",
            "support_count": 20,
            "cluster_id": 0
        },
        {
            "strategy_name": "Explicit Visual Attribute Detailing",
            "gap_type": "SPECIFICITY",
            "observation_summary": "Snippet descriptions often lack detailed, non‑generic visual cues—color, material, texture, design motifs, closure type, and unique details—resulting in low specificity and incomplete differentiation from competitors, which hampers search relevance and click‑through.",
            "action_policy": "When crafting or optimizing a snippet, first analyze the product image to identify every prominent visual attribute. Explicitly list each attribute—color, material, texture, design motifs (e.g., oversize bow, satin finish, low‑top collar), closure type, and any unique details—using precise, non‑generic language that mirrors the image. Ensure the description is both specific and complete so the product is uniquely identified and search engines can recognize its relevance.",
            "support_count": 8,
            "cluster_id": 1
        },
        {
            "strategy_name": "Comprehensive Visual Attribute Mapping",
            "gap_type": "SPECIFICITY",
            "observation_summary": "Descriptions frequently miss or generalize key visual cues (e.g., using \"soft leather\" or \"fashionable\"), causing ranking failures because the text does not fully reflect the image’s visible attributes.",
            "action_policy": "For every product description, explicitly list all visible features—silhouette, material, construction, embellishments, colors, and functional details—using precise, sensory‑rich language that matches the image (e.g., replace generic terms with descriptors like \"soft polished suede upper,\" \"silver buckle with strap,\" \"fringed leather toe,\" \"rubber woven outsole\").",
            "support_count": 13,
            "cluster_id": 2
        },
        {
            "strategy_name": "Visual Attribute Fidelity",
            "gap_type": "COMPLETENESS",
            "observation_summary": "Descriptive text often omits, mislabels, or oversimplifies prominent visual cues in product images—such as material, color, closure style, toe shape, heel type, sole material, pattern, and embellishments—leading to a mismatch between the visual reality and the textual description. This misalignment reduces relevance signals for search‑engine ranking algorithms.",
            "action_policy": "For every product, enumerate **all** observable visual traits with precise, image‑aligned terminology. Explicitly state material, color, closure, toe shape, heel type, sole material, pattern, and any distinguishing embellishments. Avoid generic, contradictory, or omitted language to ensure the description fully captures the image content.",
            "support_count": 9,
            "cluster_id": 3
        },
        {
            "strategy_name": "Visual Attribute Fidelity & Completeness Principle",
            "gap_type": "COMPLETENESS",
            "observation_summary": "Product listings frequently omit or misrepresent every visual trait shown in the images—using generic descriptors, contradictory qualifiers, or including non‑existent features—causing a misalignment between the textual data and the visual content. This reduces crawler matching accuracy and weakens search‑engine relevance and ranking.",
            "action_policy": "For each product, conduct a detailed attribute audit: identify all visible traits (toe shape, heel type and height, material finish, closure style, distinct design details, etc.) and describe each with precise, non‑generic terms that exactly match the image. Exclude any feature that is not actually present and avoid contradictory qualifiers. Use a structured checklist to verify completeness before publishing.",
            "support_count": 11,
            "cluster_id": 4
        },
        {
            "strategy_name": "Visual‑Textual Completeness & Specificity Alignment",
            "gap_type": "COMPLETENESS/SPECIFICITY",
            "observation_summary": "Product descriptions frequently omit or generalize key visual details—materials, colors, shapes, finishes, dimensions, and counts—causing misalignment with the image and harming search visibility.",
            "action_policy": "Explicitly list every visual element the user can see in the image using concrete, searchable language. Replace generic adjectives with precise descriptors, include all measurable attributes, and match terminology to common search queries to signal strong relevance and improve click‑through.",
            "support_count": 9,
            "cluster_id": 5
        },
        {
            "strategy_name": "Complete Visual Attribute Coverage",
            "gap_type": "COMPLETENESS",
            "observation_summary": "Listings that omit detailed visual descriptors—material, color, shape, dimensions, and functional traits—fail to resonate with search engines and shoppers, leading to low rankings. Successful products embed a full visual narrative, turning generic labels into rich, query‑friendly content.",
            "action_policy": "For every product, ensure the description and structured data enumerate all observable visual attributes: material, color, geometry (size, shape, proportions), and functional elements (bulb type, mounting style, adjustability). This exhaustive coverage must be consistent across all listings to provide search engines with the richest contextual signals.",
            "support_count": 8,
            "cluster_id": 6
        },
        {
            "strategy_name": "Accurate Visual Attribute Naming",
            "gap_type": "SPECIFICITY",
            "observation_summary": "Product descriptions frequently omit or misrepresent key visual characteristics (color, material, shape, finish), leading to poor visual match and weakened relevance signals.",
            "action_policy": "Ensure every prominent visual attribute in the product image is explicitly and accurately named in the description. Use precise terms for color, material, shape, and finish, and avoid generic or incorrect substitutions.",
            "support_count": 9,
            "cluster_id": 7
        },
        {
            "strategy_name": "Concrete Visual Material Detailing",
            "gap_type": "SPECIFICITY",
            "observation_summary": "Descriptions often use generic or vague material terms (e.g., \"brass body\", \"various colors\"), which do not align with the actual visual content. This mismatch leads to inaccurate search signals, reduced user trust, and poorer discoverability.",
            "action_policy": "Always list every visible material component in the product description—color, finish, texture, and internal structure—using precise, concrete language. Replace generic phrases with specific details (e.g., \"brass knob body with steel internal structure, zinc alloy handle set, antique brass finish\"). Ensure the text mirrors the imagery exactly to provide consistent, descriptive signals for search engines and users.",
            "support_count": 7,
            "cluster_id": 8
        },
        {
            "strategy_name": "Mirror‑Image Copy Strategy",
            "gap_type": "SPECIFICITY",
            "observation_summary": "Product descriptions that omit or use generic wording for visible details fail to provide a clear, relevant signal to search engines, leading to inconsistent ranking performance.",
            "action_policy": "For every product, deconstruct the image first: list all materials, shapes, sizes, finishes, and functional hardware. Describe each item with precise, unambiguous terms and include measurable data whenever possible. Avoid vague adjectives such as \"vintage‑inspired\" or \"clean profile\" and instead provide concrete, photo‑aligned details that can be parsed and indexed by search algorithms.",
            "support_count": 13,
            "cluster_id": 9
        },
        {
            "strategy_name": "Visual Detail Completeness Strategy",
            "gap_type": "COMPLETENESS",
            "observation_summary": "Product descriptions frequently omit or generalize visible attributes (material, finish, color, texture, structural components), causing a mismatch with user intent and reducing search relevance.",
            "action_policy": "Ensure every visible detail is explicitly named in the description using precise, user‑expected terminology. The text must mirror the image by listing all materials, finishes, colors, textures, and structural components without resorting to generic phrases.",
            "support_count": 9,
            "cluster_id": 10
        },
        {
            "strategy_name": "Complete Visual Attribute Capture",
            "gap_type": "COMPLETENESS",
            "observation_summary": "Product descriptions often omit key visual details—finish, material, color, shape, dimensions, and functional traits—resulting in generic text that fails to mirror what the user sees and lowers search relevance.",
            "action_policy": "For every image-driven query, the Optimizer Agent must list every observable feature of the product in precise, query-aligned language. Include finish, material, color, shape, measurements, and functional details, ensuring the description is fully descriptive, specific, and mirrors the visual content presented.",
            "support_count": 5,
            "cluster_id": 11
        },
        {
            "strategy_name": "Visual Feature Completeness",
            "gap_type": "COMPLETENESS",
            "observation_summary": "Copy often omits or glosses over key visual elements—components, hardware, and exact measurements—leading to incomplete, vague descriptions that fail to satisfy search‑ranking signals for detail-rich content.",
            "action_policy": "When crafting product copy, explicitly identify every prominent visual element shown in the image—including components, hardware, and precise measurements—and weave those details into the description, ensuring the text mirrors the image’s full visual story.",
            "support_count": 3,
            "cluster_id": 12
        },
        {
            "strategy_name": "Complete Visual Feature Description",
            "gap_type": "COMPLETENESS",
            "observation_summary": "Product listings that omit any visible attribute (e.g., a door handle, its shape, finish, or size) fail to satisfy user intent and are penalized in rankings.",
            "action_policy": "Ensure every key visual element in the image is explicitly named and described in the product description, covering its presence, dimensions, shape, finish, and any distinguishing characteristics highlighted by the query or image.",
            "support_count": 3,
            "cluster_id": 13
        },
        {
            "strategy_name": "Atmospheric Lifestyle Narrative",
            "gap_type": "ATMOSPHERE",
            "observation_summary": "Product listings that rely solely on dry technical specs lack relevance and engagement. They fail to resonate with users’ search intent and obscure the lifestyle context that drives buying decisions, leading to lower rankings and reduced click‑through rates.",
            "action_policy": "Replace mechanical checklists with vivid, brand‑aligned lifestyle scenes. Introduce a use‑case scenario, use sensory, mood‑building adjectives, embed key specs within the story, mirror the searcher’s intent, and reference pairing cues to create an aspirational, contextual image.",
            "support_count": 16,
            "cluster_id": 14
        },
        {
            "strategy_name": "Visual Attribute Precision Principle",
            "gap_type": "SPECIFICITY",
            "observation_summary": "Copy often fails to fully and precisely describe every prominent visual trait in product images, using generic or vague descriptors that miss key details such as color, texture, material, shape, size, and design cues. This leaves shoppers uncertain and hampers search alignment.",
            "action_policy": "For every product image, translate every observable visual attribute into the copy with explicit, vivid, and specific terminology. Include colors, textures, materials, shapes, sizes, and design cues (e.g., floral pattern, velvet with subtle grooves, mid‑century style, yarn‑dyed stripe). Avoid generic words such as 'nice', 'beautiful', or 'stylish'. Ensure the description is complete and mirrors exactly what shoppers see to close the translation gap and improve search relevance.",
            "support_count": 12,
            "cluster_id": 15
        },
        {
            "strategy_name": "Complete Visual Detail Optimization",
            "gap_type": "COMPLETENESS",
            "observation_summary": "Product descriptions frequently omit explicit visual attributes—shape, material, color, texture, style, size, and unique design cues—relying instead on generic metadata like origin or assembly. This leads to incomplete, flat listings that fail to satisfy user intent and hurt ranking performance.",
            "action_policy": "When generating or revising product descriptions, first enumerate every visible attribute: shape, material, color, texture, style, size, and distinctive design cues. Use precise, sensory adjectives (e.g., \"hand‑tufted velvet,\" \"solid‑wood frame,\" \"blackened pewter legs,\" \"tapered wooden supports\") and concrete details. Then craft a short, evocative narrative that weaves these facts into an atmospheric portrayal of the product. Avoid generic metadata such as origin or assembly unless it is a direct visual attribute. This completes the description, enriches the user experience, and aligns with ranking signals.",
            "support_count": 7,
            "cluster_id": 16
        },
        {
            "strategy_name": "Visual Accuracy & Detail Principle",
            "gap_type": "SPECIFICITY",
            "observation_summary": "Product copy frequently generalizes or omits concrete visual cues (color, pattern, texture, shape, material) present in the image, leading to misalignment between what the shopper sees and what the title/description promises, which hurts relevance and SEO performance.",
            "action_policy": "For every product image, review all visible attributes—exact hues, patterns, textures, shapes, and structural features. Translate those observations into concise, precise, image‑aligned language in both title and description. Avoid generic descriptors; use specific adjectives that mirror the visual experience. Verify each claim can be visually confirmed. This alignment ensures higher relevance for search engines and greater trust for shoppers, boosting CTR and conversion.",
            "support_count": 17,
            "cluster_id": 17
        },
        {
            "strategy_name": "Image-Driven Completeness Alignment",
            "gap_type": "COMPLETENESS",
            "observation_summary": "Product descriptions frequently fail to reflect the full set of observable attributes in the image—type, shape, size, color palette, pattern, material, and functional features—resulting in incomplete and misaligned content that does not satisfy user intent.",
            "action_policy": "For every image-based product description, explicitly list all visible attributes—product type, shape, dimensions, color scheme, pattern, material composition, and functional features—using precise, descriptive language, and omit unrelated or generic details. The description must fully mirror the visual reality to enhance relevance and search performance.",
            "support_count": 7,
            "cluster_id": 18
        },
        {
            "strategy_name": "Image‑Anchored Visual Detail Specificity",
            "gap_type": "SPECIFICITY",
            "observation_summary": "Product copy frequently overlooks or generalizes the visual cues present in the image—color palette, patterns, textures, shapes, and materials—leading to weaker search signals and lower ranking. Users and search engines expect the copy to reflect exactly what they see; omission of these details causes intent mismatch.",
            "action_policy": "Prior to finalizing any product description, perform a systematic image audit: enumerate every prominent visual attribute (color, pattern, texture, shape, material, style, etc.). Rewrite the copy so that each listed attribute is explicitly described with concrete, precise language. Avoid generic or incomplete statements, and ensure the description mirrors the image as closely as possible.",
            "support_count": 8,
            "cluster_id": 19
        },
        {
            "strategy_name": "Comprehensive Visual Detail Strategy",
            "gap_type": "COMPLETENESS",
            "observation_summary": "Product listings often fail to rank because descriptions omit key visual elements or use generic wording, reducing relevance to user queries.",
            "action_policy": "When generating or revising a product description, always enumerate every visual attribute—material, color, texture, finish, dimensions, and spatial arrangement of components—using a structured template. Verify each element against the source image, replace generic terms with precise descriptors (e.g., \"solid brown‑stained wood with a smooth finish\"), and ensure no key visual detail is omitted.",
            "support_count": 7,
            "cluster_id": 20
        }
    ]
}