{
    "mgeo_principles": [
        {
            "strategy_name": "Visual Fidelity Precision",
            "gap_type": "COMPLETENESS",
            "observation_summary": "Descriptions frequently omit or mislabel visible attributes (color, material, silhouette, pattern, embellishments), leading to a mismatch with shopper expectations and lower search ranking.",
            "action_policy": "When crafting product descriptions from images, explicitly list every observable attribute using precise, match‑level terminology. Avoid generic or inaccurate terms, ensure all salient visual cues are covered, and verify that each mentioned element actually appears in the image before finalizing the description.",
            "support_count": 21,
            "cluster_id": 0
        },
        {
            "strategy_name": "Pattern Visibility Principle",
            "gap_type": "COMPLETENESS",
            "observation_summary": "Descriptions that omit or generalize the product’s visible pattern—especially printed floral motifs and embroidered details—result in lower search relevance scores. The absence of precise, descriptive language about the pattern prevents alignment with shopper search intent.",
            "action_policy": "Always capture every visible pattern or design element in the product description using specific, vivid language (e.g., 'printed floral pattern with embroidered flowers in tan suede'). This ensures the text fully mirrors the image’s distinctive features and meets user search intent.",
            "support_count": 8,
            "cluster_id": 1
        },
        {
            "strategy_name": "Visual Feature Enumeration Principle",
            "gap_type": "COMPLETENESS",
            "observation_summary": "Omitting or misrepresenting any major visual attribute—material, color, shape, number of parts, arrangement, or distinguishing cues—weakens semantic alignment with the image, leading to lower relevance and ranking failure.",
            "action_policy": "Always scan the image for all prominent features, list them explicitly in the description, avoid contradictory or irrelevant details, and verify the description matches the visual reality before publishing.",
            "support_count": 8,
            "cluster_id": 2
        },
        {
            "strategy_name": "Image‑Text Detail Convergence",
            "gap_type": "SPECIFICITY",
            "observation_summary": "Product copy often lacks the concrete, material‑level details that are immediately visible in the accompanying image, creating a mismatch between what shoppers see and what the description says. This generic, incomplete language reduces perceived quality, hampers keyword relevance, and ultimately hurts ranking and click‑through.",
            "action_policy": "For every product image, list every material, dimension, and functional component that is clearly visible. Use precise, technical language (e.g., \"brass body\", \"zinc alloy latch bolt\", \"10‑inch adjustable latch width\"). Ensure the copy mirrors the image’s concrete details, avoids generic adjectives, and directly addresses user intent, thereby increasing specificity, trust, and search‑ranking performance.",
            "support_count": 16,
            "cluster_id": 3
        },
        {
            "strategy_name": "Complete Visual Attribute Precision Principle",
            "gap_type": "COMPLETENESS",
            "observation_summary": "Omitting or glossing over any visible attribute in an image-based product description—such as type, style cue, material, color, texture, pattern, or shape—creates an incomplete listing. This deficiency reduces relevance for user queries and lowers search ranking.",
            "action_policy": "When optimizing a description for image‑based search, list every visible attribute explicitly and use precise, specific terminology that matches the visual content and aligns with typical user search terms.",
            "support_count": 8,
            "cluster_id": 4
        },
        {
            "strategy_name": "Visual Attribute Precision Principle",
            "gap_type": "SPECIFICITY",
            "observation_summary": "Product descriptions that fail to explicitly name every observable visual attribute—texture, material, color, finish, pattern, structural elements, and style cues—are penalized in search‑engine rankings. This lack of concrete, vivid detail makes the content less relevant, less authoritative, and harder for crawlers to index effectively.",
            "action_policy": "When generating or optimizing a product description, the agent must: 1) Identify all visual attributes present in the image; 2) Use precise, vivid terminology for each attribute (e.g., \"velvet\", \"brushed brass\", \"deep burgundy\", \"herringbone pattern\", \"low‑profile frame\"); 3) Ensure no observable feature is omitted or generalized; and 4) Align the language tightly with the photo’s visual reality to maximize relevance and indexability.",
            "support_count": 15,
            "cluster_id": 5
        },
        {
            "strategy_name": "Explicit Visual & Detail Enumeration",
            "gap_type": "SPECIFICITY",
            "observation_summary": "Product listings frequently omit concrete visual cues (pattern, colors, shape, material, texture) and key functional attributes, resulting in vague, incomplete copy that fails to align with shopper intent and image content.",
            "action_policy": "When drafting or revising a product description, always begin by deconstructing the image: list every visible pattern, primary colors, their arrangement, shape/size, material, and texture. Then confirm all essential product details—type, construction, durability, functional use, and color/pattern options—are fully captured. Avoid generic adjectives and ensure the copy is a precise, exhaustive reflection of the image and product attributes.",
            "support_count": 17,
            "cluster_id": 6
        },
        {
            "strategy_name": "Image‑Aligned Descriptive Precision",
            "gap_type": "SPECIFICITY",
            "observation_summary": "Product descriptions often omit or generalize key visual features shown in the image, leading to weak search signals and poor ranking.",
            "action_policy": "For every product image, list each visible attribute—material, shape, heel type, strap style, buckle, color, embellishment, silhouette, and any distinguishing detail—and translate them into concrete, specific language. Avoid generic or vague phrases that do not match the eye. Align the copy tightly with the image’s visual reality to strengthen relevance and improve search performance.",
            "support_count": 10,
            "cluster_id": 7
        },
        {
            "strategy_name": "Feature Completeness Enforcement",
            "gap_type": "COMPLETENESS",
            "observation_summary": "Descriptions frequently omit key visual or structural attributes (heel type, strap arrangement, platform, closure, material, etc.), leading to incomplete matches with user search intent and lower ranking.",
            "action_policy": "When generating product copy, always list every essential visual and structural feature that users are likely to search for—heel type, strap configuration, platform height, closure style, material, and any distinguishing detail—explicitly naming each one to ensure full alignment with user expectations.",
            "support_count": 8,
            "cluster_id": 8
        },
        {
            "strategy_name": "Visual Attribute Inclusion Mandate",
            "gap_type": "COMPLETENESS",
            "observation_summary": "Optimizers frequently omit or over‑generalize visible product features, instead inserting unrelated sizing or generic descriptors. This neglect of material, color, shape, embellishments, and functional elements erodes relevance signals for search engines and weakens the user’s contextual understanding.",
            "action_policy": "Before appending any optional or promotional text, generate a structured, exhaustive list of all visible attributes—materials, colors, shapes, sizes, embellishments, and functional components (e.g., straps, buckles, heels, toe styles). Only after this mandatory coverage should additional context or style guidance be added.",
            "support_count": 9,
            "cluster_id": 9
        },
        {
            "strategy_name": "Complete Visual Attribute Mapping",
            "gap_type": "COMPLETENESS",
            "observation_summary": "Rankings degrade when product descriptions omit essential visual details—color, shape, material, texture, branding, functional gauges, weight, or distinctive patterns—causing misalignment with user intent and the displayed image.",
            "action_policy": "For every product, explicitly list all salient visual attributes in the description: use precise, non‑generic terms for color, shape, material, texture, branding, and any functional gauges or weight. Include unique patterns, logos, and distinctive visual cues. Avoid placeholders or vague wording. Ensure the description text fully maps to the image so that search engines recognize the completeness of the visual attributes.",
            "support_count": 6,
            "cluster_id": 10
        },
        {
            "strategy_name": "Visual Attribute Alignment",
            "gap_type": "SPECIFICITY",
            "observation_summary": "Product listings consistently omit explicit, exhaustive visual details—color, shape, texture, dimensions, finishes, logos, and functional markings—leading to a mismatch between image context and descriptive text.",
            "action_policy": "For every image‑paired product description, explicitly enumerate every observable visual attribute: color names, material, texture, shape/silhouette, dimensions, finish, functional markings (gauge, cut‑outs, logos, etc.), and any other distinguishing visual cues. Align the language precisely with the image to close the specificity gap and enhance search relevance, click‑through, and ranking.",
            "support_count": 18,
            "cluster_id": 11
        },
        {
            "strategy_name": "Visual Attribute Precision & Atmosphere",
            "gap_type": "COMPLETENESS",
            "observation_summary": "Listings that omit, mislabel, or under‑describe any species, color, pattern, texture, or form fail to match the image and dilute relevance signals, causing lower search rankings.",
            "action_policy": "Ensure every product listing explicitly references all visually relevant features shown in the image and enrich the description with evocative, atmosphere‑matching language that reflects the product’s natural or playful vibe.",
            "support_count": 15,
            "cluster_id": 12
        },
        {
            "strategy_name": "Explicit Visual Attribute Detailing Principle",
            "gap_type": "COMPLETENESS",
            "observation_summary": "Product descriptions that omit or generalize key visual cues (color, pattern, texture, shape, size, material) fail to match the image, leading to lower perceived relevance and ranking drops.",
            "action_policy": "When generating product descriptions, the Optimizer Agent must explicitly list every significant visual attribute present in the image—color(s), pattern(s), texture(s), shape(s), size(s), and material(s)—to ensure complete and accurate text‑image alignment.",
            "support_count": 7,
            "cluster_id": 13
        },
        {
            "strategy_name": "Visual Precision Alignment",
            "gap_type": "SPECIFICITY",
            "observation_summary": "Generic visual descriptors (e.g., \"cool white\", \"warm white\") create a mismatch between product copy and images, undermining search‑engine relevance and confusing shoppers.",
            "action_policy": "When writing copy, always include exact, matchable visual details—specific Kelvin ratings, lumen counts, and concrete ambient descriptors that reflect the product’s true appearance. Avoid vague terms without numeric anchors.",
            "support_count": 14,
            "cluster_id": 14
        },
        {
            "strategy_name": "Accurate Visual Alignment",
            "gap_type": "COMPLETENESS",
            "observation_summary": "Descriptions frequently omit or misrepresent key visual attributes (shape, quantity, base color, arrangement, distinctive design elements), leading to incomplete or inaccurate representations of the image content.",
            "action_policy": "When drafting or ranking product snippets, explicitly enumerate every observable visual attribute present in the image—number of units, shape, base color, layout, and any distinctive design elements—and never add invented attributes or make assumptions. Ensure the textual description matches the image exactly to achieve full completeness and alignment.",
            "support_count": 9,
            "cluster_id": 15
        },
        {
            "strategy_name": "Visual Fidelity Principle",
            "gap_type": "COMPLETENESS",
            "observation_summary": "Descriptions frequently omit or misrepresent visible attributes—colors, patterns, textures, and stylistic cues—leading to a mismatch between text and image.",
            "action_policy": "When drafting a product description, first enumerate every visible color, pattern, texture, and stylistic element in the image. Ensure that each is explicitly mentioned in the text, and avoid adding technical details or attributes that are not visually present. This guarantees a fully aligned, visually complete description.",
            "support_count": 7,
            "cluster_id": 16
        },
        {
            "strategy_name": "Complete Visual Attribute Translation",
            "gap_type": "COMPLETENESS",
            "observation_summary": "Product descriptions frequently omit visible or functional cues—such as zipper style, corner ties, envelope opening, dimensions, fabric, and care instructions—creating a completeness gap that reduces relevance and search ranking.",
            "action_policy": "The Optimizer Agent must audit every product description to ensure all visual and functional attributes present on the item are explicitly and accurately reflected in the text. Any missing cue must be added before finalizing the description.",
            "support_count": 14,
            "cluster_id": 17
        },
        {
            "strategy_name": "Feature-Full Descriptions",
            "gap_type": "COMPLETENESS",
            "observation_summary": "Copy that omits visible product features (closures, handles, straps, pocket count, size, material, color, style adjectives, etc.) fails to match the image, causing ranking drops.",
            "action_policy": "Always enumerate every visible functional feature, dimension, and aesthetic cue shown in the image when crafting product descriptions.",
            "support_count": 4,
            "cluster_id": 18
        },
        {
            "strategy_name": "Visual Attribute Precision Alignment",
            "gap_type": "SPECIFICITY",
            "observation_summary": "Product copy frequently omits or generalizes key visual traits—color, material, pattern, size, shape—causing a disconnect between user intent and image content, which negatively impacts ranking performance.",
            "action_policy": "For every image, the Optimizer Agent must list the exact color(s), material(s), pattern(s), size(s), shape(s), and any other observable attributes in concrete, measurable terms. Avoid generic descriptors such as \"bright,\" \"fabric,\" or \"large.\" Ensure each attribute is explicitly named so the copy mirrors the visual reality and satisfies user intent.",
            "support_count": 15,
            "cluster_id": 19
        },
        {
            "strategy_name": "Visual Detail Precision",
            "gap_type": "COMPLETENESS",
            "observation_summary": "Product descriptions often omit or generalize key visual elements in the accompanying image, such as the exact stone shapes, cuts, sizes, arrangements, band designs, and materials, resulting in a weak semantic match and lower relevance.",
            "action_policy": "Always enumerate every prominent visual feature visible in the image using precise terminology (e.g., \"Swarovski Zirconia, round brilliant cut, half‑eternity band\") and ensure that every stone, band style, and arrangement is explicitly described. Avoid generic placeholders and confirm that the description fully mirrors the image’s visible details.",
            "support_count": 11,
            "cluster_id": 21
        },
        {
            "strategy_name": "Visual Attribute Precision Strategy",
            "gap_type": "COMPLETENESS",
            "observation_summary": "Listings often omit or use generic/mis‑named visual attributes (e.g., \"pave‑set\", \"Princess‑Cut\"), resulting in incomplete, inconsistent descriptions that lower relevance scores.",
            "action_policy": "For every product listing, enforce a standardized, detailed specification of all key visual attributes—cut shape, stone count, arrangement (halo, band style), and material—using the defined taxonomy. Run an automated audit that cross‑checks the text, schema, and imagery for consistency, flagging and correcting any gaps before publication.",
            "support_count": 8,
            "cluster_id": 22
        },
        {
            "strategy_name": "Sensory Detail Alignment",
            "gap_type": "SPECIFICITY",
            "observation_summary": "Product descriptions routinely omit or generalize visual cues from the image—color, pattern, texture, finish, weave, shape, and overall aesthetic—using vague, generic language that fails to match what shoppers actually see. This results in incomplete, non‑sensory content that does not satisfy search intent or search engine relevance.",
            "action_policy": "For every product image, the Optimizer Agent must translate each observable visual feature into explicit, sensory‑rich language. Use precise terms such as ‘100 % linen’, ‘wrinkle‑resistant microfiber’, ‘satin weave’, ‘hand‑stitched boucle’, or ‘matte‑finish chrome’. Ensure texture, finish, weave, and material are named concretely, mirroring the shopper’s visual experience, and replace all generic or non‑specific phrases with concrete, descriptive terms.",
            "support_count": 17,
            "cluster_id": 23
        },
        {
            "strategy_name": "Full Visual Detail Alignment",
            "gap_type": "COMPLETENESS",
            "observation_summary": "Descriptions frequently omit or generalize key visual attributes—color, pattern, texture, shape, material, dimensions, and distinctive design elements—leading to incomplete coverage and misalignment with the shopper’s visual intent.",
            "action_policy": "For every product description, the Optimizer Agent must explicitly enumerate all observable visual attributes present in the image, ensuring both breadth (every attribute is listed) and depth (each attribute is described with specific, sensory language). The copy must mirror the image’s visual narrative, match size, color, material, and style, and avoid extraneous technical specs that are not visible. This guarantees complete, specific, and atmospheric alignment with the shopper’s visual perception.",
            "support_count": 19,
            "cluster_id": 24
        },
        {
            "strategy_name": "Full Visual & Specification Alignment Principle",
            "gap_type": "COMPLETENESS",
            "observation_summary": "Product descriptions often omit or generalize the visual traits and functional specifications shown in the product image, leading to incomplete, ambiguous content that fails to meet user expectations and harms search ranking.",
            "action_policy": "When generating or revising product descriptions, always extract every observable visual attribute (color, texture, material, shape) and every measurable functional specification (dimensions, fit type, pocket depth, etc.) directly from the product image. Use concrete, image‑grounded language and avoid generic placeholders. Ensure the description fully reflects the image’s details to maximize relevance and ranking.",
            "support_count": 5,
            "cluster_id": 25
        },
        {
            "strategy_name": "Visual‑Text Alignment Principle",
            "gap_type": "SPECIFICITY",
            "observation_summary": "Copy that omits or generalizes any visually observable detail—product type, packaging shape/color, brand, or certification icons—produces a mismatch between image and description. This dilution of relevance lowers search‑engine ranking and click‑through rates.",
            "action_policy": "For every listing, explicitly name every item the shopper can see in the image: product type as labeled, exact packaging style (resealable bag, pouch, size), visible color/shape cues, brand name, and any certification or icon. Avoid generic descriptors or substitutions that do not match the visual reality.",
            "support_count": 25,
            "cluster_id": 26
        },
        {
            "strategy_name": "Visual Completeness & Relevance Principle",
            "gap_type": "COMPLETENESS",
            "observation_summary": "Product descriptions frequently omit or misrepresent key visual attributes and often include emotive or abstract language that distracts from shopper intent, resulting in incomplete visual translation and reduced search relevance.",
            "action_policy": "For every listing, incorporate every salient visual feature present in the product image that aligns with the search query (shape, size, color, closure, packaging, visible accessories, etc.). Use concise, factual, feature‑based language and explicitly avoid emotive, superfluous, or abstract wording that does not convey observable attributes.",
            "support_count": 10,
            "cluster_id": 27
        },
        {
            "strategy_name": "Sensory-Driven Product Descriptions",
            "gap_type": "ATMOSPHERE",
            "observation_summary": "Product listings frequently rely on dry specifications and fail to evoke a vivid, sensory image of the item, preventing shoppers from forming a clear mental picture and emotional connection. This lack of atmospheric detail diminishes relevance, differentiation, and click‑through rates.",
            "action_policy": "Embed rich, sensory language that describes material, clarity, shape, color, sheen, and design style in a narrative form. Use vivid adjectives and evocative imagery that align with the actual appearance of the product, creating a clear mental visual and emotional anchor for the shopper.",
            "support_count": 9,
            "cluster_id": 28
        },
        {
            "strategy_name": "Precision Visual Narrative",
            "gap_type": "SPECIFICITY",
            "observation_summary": "Product listings frequently omit concrete visual details—using vague terms or generic phrasing that fails to mirror the image’s material, color, shape, dimensions, and unique design elements. This mismatch causes search‑engine relevance penalties and reduces buyer trust.",
            "action_policy": "The Optimizer Agent must craft descriptions that explicitly enumerate every observable cue in the image: material type, exact color(s), shape descriptors, measured dimensions, and distinctive design features (e.g., rim style, stem type, finish). Avoid generic adjectives; instead, provide a vivid, item‑specific narrative that aligns perfectly with the visual content to satisfy both shoppers and search‑engine algorithms.",
            "support_count": 14,
            "cluster_id": 29
        }
    ]
}