{
    "mgeo_principles": [
        {
            "principle_id": "GEO_COMPLETENESS",
            "rule_name": "Visual Completeness Axiom",
            "trigger": "Any visible attribute absent from the text (e.g., objects, shapes, dimensions, hardware, or functional features)",
            "action_policy": "Enumeration Strategy: Scan the image to create a comprehensive, comma‑separated list of all distinct visual objects and features that are present but not mentioned. The list must include items such as buckles, straps, soles, logos, size markings, and any structural details. If any element is missing from the existing description, append it to the description immediately, ensuring no overlap with Texture or Pattern rules."
        },
        {
            "principle_id": "GEO_TEXTURE",
            "rule_name": "Texture Specificity Protocol",
            "trigger": "Use of generic material terms (e.g., 'cloth', 'leather') or absence of a tactile descriptor",
            "action_policy": "Refinement Strategy: Replace every generic material noun with the most specific tactile adjective observed in the image (e.g., 'distressed suede', 'ribbed knit', 'smooth satin'). If a tactile descriptor is not visually evident, leave the material noun unchanged. Ensure that each material mention is accompanied by a texture adjective, and no generic terms remain."
        },
        {
            "principle_id": "GEO_PATTERN",
            "rule_name": "Pattern Identification Protocol",
            "trigger": "No explicit pattern description or use of generic pattern terms (e.g., 'print', 'design')",
            "action_policy": "Pattern Discovery Strategy: Identify the exact pattern type (floral, striped, geometric, abstract), color palette, arrangement, and any embellishments visible in the image. Replace any generic phrase with a precise, vivid description such as 'printed floral pattern with embroidered roses in emerald green' or 'black-and-white pinstripe with diagonal offset'. Ensure the resulting phrase fully reflects the pattern’s visual characteristics."
        }
    ]
}